import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex)

export default new Vuex.Store({
  state: {
    categories: [{
        name: "בית",
        link: "/",
        id: 1,
      },
      {
        name: "חנות",
        link: "/store",
        id: 2,
      },
    ],
    products: [ {
      name: "אדניות אדניות אדניות",
      img: require("@/assets/ass6.jpg"),
      description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
      description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

      אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
      description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

      אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
      description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

      אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
      addCart: false,
      price: 1490,
      previousPrice: 0,
      amount: 0,
      id: 1
    },
      {
        name: "אדניות אדניות אדניות",
        img: require("@/assets/ass6.jpg"),
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        id: 2
      },
      {
        name: "אדניות אדניות אדניות",
        img: require("@/assets/ass6.jpg"),
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        id: 3
      },
      {
        name: "אדניות אדניות אדניות",
        img: require("@/assets/ass6.jpg"),
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        id: 4
      },
      {
        name: "אדניות אדניות אדניות",
        img: require("@/assets/ass6.jpg"),
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        id: 5
      },
      {
        name: "אדניות אדניות אדניות",
        img: require("@/assets/ass6.jpg"),
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        id: 6
      },
    ]
  },
  getters: {
    inCart: (state) => {
      let inCart = state.products.filter((value) => {
        return value.amount > 0
      })
      return inCart
    },
  },
  mutations: {
    changeAmount(state, amountAndId) {
      for (let i in state.products) {
        if (state.products[i].id == amountAndId.id) {
          state.products[i].amount += amountAndId.amount
        }
      }
    }
  },
  actions: {},
  modules: {}
})