import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex)

export default new Vuex.Store({
  state: {
    clientDatdlis: {},
    messengerPrice: 40,
    ifMessenger: true,
    categories: [{
        name: "בית",
        link: "/",
        id: 1,
      },
      {
        name: "חנות",
        link: "/store/all",
        id: 2,
      },
    ],
    products: [ {
      name: "אדנית מסגרת",
      img: [require("@/assets/IMG_1208.jpg"), require("@/assets/IMG_1209.jpg"), require("@/assets/IMG_1210.jpg"), require("@/assets/IMG_1230.jpg"), require("@/assets/IMG_1240.jpg"), require("@/assets/IMG_1263.jpg")],
      description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
      description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

      אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
      description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

      אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
      description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

      אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
      addCart: false,
      price: 1490,
      previousPrice: 0,
      amount: 0,
      category: "regular",
      id: 1
    },
      {
        name: "תכלת",
        img: [require("@/assets/IMG_1220.jpg"), require("@/assets/IMG_1188.jpg"), require("@/assets/IMG_1195.jpg")],
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        category: "special",
        id: 2
      },
      {
        name: "אדנית מלבן",
        img: [require("@/assets/IMG_1355.jpg"), require("@/assets/IMG_1311.jpg"), require("@/assets/IMG_1329.jpg"), require("@/assets/IMG_1358.jpg")],
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        category: "special",
        id: 3
      },
      {
        name: "סט קוביות",
        img: [require("@/assets/IMG_1272.jpg"), require("@/assets/IMG_1277.jpg"), require("@/assets/IMG_1301.jpg"), require("@/assets/IMG_1269.jpg"), require("@/assets/IMG_1298.jpg")],
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        category: "regular",
        id: 4
      },
      {
        name: "מריצה",
        img: [require("@/assets/IMG_1254.jpg"), require("@/assets/IMG_1258.jpg"), require("@/assets/IMG_1260.jpg"), require("@/assets/IMG_1283.jpg"), require("@/assets/IMG_1332.jpg")],
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        category: "regular",
        id: 5
      },
      {
        name: "טרפז",
        img: [require("@/assets/IMG_1348.jpg"), require("@/assets/IMG_1349.jpg")],
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        category: "regular",
        id: 6
      },
      {
        name: "אביזרים",
        img: [require("@/assets/IMG_1323.jpg"), require("@/assets/IMG_1242.jpg")],
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        category: "regular",
        id: 7
      },
      {
        name: "שלטים",
        img: [require("@/assets/IMG_1284.jpg"), require("@/assets/IMG_1351.jpg"), require("@/assets/IMG_1354.jpg")],
        description: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן,`,
        description1: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description2: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        description3: `אדנית היא מכל לטיפוח צמחים המיועד להצבה על אדן חלון של בתים. בתוך אדנית מצע לגידול צמחים, בדרך כלל עפר מדושן, ובו נזרעים או נשתלים צמחים פרחוניים. נועדה לנוי ולקישוט הבית, מבחוץ ומבפנים.

        אדניות מיוצרות ממגוון חומרים: עץ, פלסטיק ואחרים.`,
        addCart: false,
        price: 1490,
        previousPrice: 0,
        amount: 0,
        category: "regular",
        id: 8
      },
    ]
  },
  getters: {
    inCart: (state) => {
      let inCart = state.products.filter((value) => {
        return value.amount > 0
      })
      return inCart
    },
    Payable: (state, getters) => {
      let Payable = 0;
      for (let x in getters.inCart) {
        Payable += getters.inCart[x].amount * getters.inCart[x].price;
      }
      return Payable
    },
    PayablePlusMessenger: (state, getters) => {
      let Payable = getters.Payable;
      if(state.ifMessenger){
        Payable + state.messengerPrice;
      }
      return Payable
    },
    
   
  },
  mutations: {
    changeAmount(state, amountAndId) {
      for (let i in state.products) {
        if (state.products[i].id == amountAndId.id) {
          state.products[i].amount = amountAndId.amount
        }
      }
    },
    setIfMessenger(state) {
      state.ifMessenger = !state.ifMessenger
    },
  },
  actions: {},
  modules: {}
})